app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hi, my name is User4"], ["user_id", 4], ["created_at", "2018-10-18 16:42:36.557938"], ["updated_at", "2018-10-18 16:42:36.557938"]]