app/controllers/static_pages_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE (user_id IN (2) OR user_id = 1) ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships
---
  def home
    if signed_in?
      @micropost  = current_user.microposts.build
      @feed_items = current_user.feed.paginate(page: params[:page])