app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["user_id", 3], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 3]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "remember_token") VALUES (?, ?, ?, ?, ?, ?)